# 100～入力内容
100<>サブジェクト長すぎ<>サブジェクトが長すぎます！
101<>名前長すぎ<>名前が長すぎます！
102<>メール長すぎ<>メールアドレスが長すぎます！
103<>本文長すぎ<>本文が長すぎます！
104<>1行長すぎ<>長すぎる行があります！
105<>改行多すぎ<>改行が多すぎます！
106<>アンカー多すぎ<>レスアンカーリンクが多すぎます！
150<>タイトルが無い<>サブジェクトが存在しません！
151<>本文が無い<>本文がありません！
152<>名前が無い<>名前いれてちょ。
153<>認証されてない<>Captcha認証をしてください。<br>専ブラからの場合は、通常ブラウザで<a href="{!AUTHURL!}">{!AUTHURL!}</a>から認証してください。
154<>認証失敗<>Captcha認証に失敗しました。
# 200～掲示板規制
200<>スレッド停止<>このスレッドは停止されてます。もう書けない。。。
201<>書き込み限界<>{!RESMAX!}を超えてます。このスレッドにはもう書けない。。。
202<>スレッド移転<>このスレッドは移転されたようです。詳しくは（略
203<>読取専用<>現在この掲示板は読取専用です。ここは待つしかない。。。
204<>スレッド規制<>携帯からのスレッド作成はキャップのみ可能です。<br>PCから試してみてください。
205<>CGI禁止<>現在この掲示板ではCGIの使用が禁止されてます<br>indexだけでお楽しみください。
206<>サイズオーバー<>datファイルのサイズが限界を超えました。新しいスレッドを作成してください。
207<>海外串<>JPドメイン以外からのスレッド作成を規制しています。
208<>逆引き不可<>逆引き出来ないIPからの投稿を規制しています。
# 500～投稿規制
500<>スレッド立てすぎ<>スレッド立てすぎです。もうちょいもちついてください。
501<>連続投稿<>連続投稿ですか？？
502<>二重かきこ<>二重かきこですか？？
503<>もまいらもちつけ。<>もうちょっと落ち着いて書きこみしてください。{!WAIT!}秒ぐらい。
504<>スレッド規制<>現在この板のスレッド作成はキャップのみ可能です。<br>管理人に相談してください。。。
505<>Samba規制1<>{!SAMBATIME!} sec たたないと書けません。({!SAMBA!}回目、{!WAIT!} sec しかたってない)<br>\n<br>\n今のところ、キャップ以外に回避する方法はありません。\n
506<>Samba規制2<>連打しないでください。もうそろそろ規制リストに入れますよ。。(￣ー￣)ニヤリッ<br>\n<br>\n\n
507<>Samba規制3<>もうずっと書けませんよ。<br>\n<br>\nあなたは、規制リストに追加されました。<br><br>\n【解除する方法】<br>\n{!WAIT!}分以上初心者の方々を優しく導いてあげてください。<br>\nこれ以外に解除の方法はありません。<br>\n
508<>Samba規制中<>まだ書けませんよ。<br><br>　　　　あなたは、規制リストに追加されています。 <br><br>　　　　【解除する方法】<br>　　　　{!WAIT!}分以上初心者の方々を優しく導いてあげてください。<br>　　　　これ以外に解除の方法はありません。<br>---------- 
600<>NGワード<>NGワードが含まれてます。抜かないと書き込みできません。
601<>規制ユーザ<>アクセス規制中です！！({!HITS!})
602<>SPAMブロック<>スパム行為は禁止！！
603<>スレタイ重複<>スレタイ被ってますよ。
# 700～忍法帖関係
700<>BAN<>あなたはBANされています。
701<>レベル制限<>あなたの忍法帖レベルではこのスレッドに書き込めません。
# 890～BEシステムエラー系
890<>情報取得失敗<>BEユーザー情報の取得に失敗しました。
891<>接続失敗<>be.2ch.netに接続できませんでした。({!CODE!})
892<>BEログイン失敗<>BEログインに失敗しました。({!CHK!})
893<>BEログイン必須<><a href="http://be.2ch.net/">be.2ch.net</a>でログインしてないと書けません。
894<>BE_TYPE2規制<>Beログインしてください(t)。<a href="http://be.2ch.net/">be.2ch.net</a>
# 900～スレッドエラー系
900<>スレッド指定が変です<>スレッドキーに数字以外がありそうです。<br>もう一度よく確かめてちょ。
901<>スレッド指定が変です<>スレッドキーの数がおかしいですよん。<br>もう一度よく確かめてちょ。
902<>スレッド指定が変です<>書き込もうとしているスレッドは存在しないか、削除されています。。。
# 950～システムエラー系
950<>端末固有情報不明<>端末固有情報を送信してください。
997<>ＰＲＯＸＹ規制<>公開ＰＲＯＸＹからの投稿は受け付けていません！！
998<>ブラウザ変ですよん<>アクセス不正です。このCGIは外部からのアクセスは認めてないです。。
999<>ブラウザ変ですよん<>フォーム情報が正しく読めないです。
990<>システムエラー<>システムが変です。サポート版で聞いたほうがいいかも。。
